Repository: share-extras/langpack-cy
Catalog: core/tmx/web-client.tmx
Source language: en_us
Languages: cy

source: This wizard helps you to create a new edition of a multilingual document.
cy: Mae'r dewin yma yn eich cynorthwyo i creu argraffiad newydd o ddogfen amlieithog.

source: Post Message
cy: Postio Neges

source: {0} related {0,choice,0#renditions|1#rendition|1<renditions} in {1}.
cy: {0} {0,choice,0#lluniadau|1#lluniad|1<lluniadau} perthnasol yn {1}.

source: This document is not part of any advanced workflows.
cy: Nid yw'r dogfen yma yn rhan o unrhyw lif gwaith uwch.

source: this column can display {0} components
cy: Fedra'r colofn yma arddangos {0} cydran

source: Shortcuts
cy: Llwybrau Byr

source: Assignee
cy: Trosglwyddydd

source: Web Forms
cy: Ffurflenni Gwe

source: Local copy location
cy: Lleoliad copi lleol

source: Rendering Engine Template File
cy: Ffeil Templed Peiriant Llunio

source: Translator
cy: Cyfieithwr

source: Enter information about the new forum space then click Create Forum Space.
cy: Mewnbynnwch gwybodaeth am y lle fforwm newydd a chliciwch Creu Lle Fforwm.

source: Impossible to create a new edition from this multilingual document.
cy: Methwyd creu argraffiad newydd o'r ddogfen amlieithog yma.

source: Create Forum
cy: Creu Fforwm

source: This wizard helps you to give other users access to your space.
cy: Mae'r dewin yma yn eich cynorthwyo i roi cyrchiad i'ch lle i ddefnyddwyr eraill.

source: Link Validation Report for Staging Sandbox
cy: Adroddiad Dilysu Cysylltiadau ar gyfer y Blwch Tywod Llwyfo

source: Browse Topics
cy: Pori Pynciau

source: System Error
cy: Gwall System

source: To close this wizard and apply your changes click Finish.
cy: I gau'r dewin yma a chadw eich newidiadau, cliciwch Gorffen.

source: View Content Properties
cy: Gweld Priodweddau Cynnwys

source: View Completed Task
cy: Gweld Tasgau Cyflawn

source: Modify Topic Properties
cy: Newid Priodweddau Pwnc

source: Are you sure you want to permanently delete all files and spaces from the deleted file store? The items cannot be recovered once this action has been performed.
cy: A ydych chi'n siŵr eich bod eisiau dileu pob ffeil a lle o'r stôr ffeiliau wedi'u dileu? Ni allir adfer yr eitemau ar ôl berfformio'r gweithred yma.

source: This will deploy the changes from this submission upon approval.
cy: Bydd hyn yn darparu'r newidiadau o'r cyflwyniad ar gymeradwyaeth.

source: If you do not want to edit the file now click OK to close the page.
cy: Os nad ydych eisiau golygu'r ffeil rŵan cliciwch Iawn i gau'r tudalen.

source: My Pooled Tasks
cy: Fy Nhasgau yn y Pwll

source: Root element
cy: Elfen gwreiddiol

source: By
cy: Gan

source: Click here to select an existing Space
cy: Cliciwch yma i ddewis Lle cyfredol

source: Successfully reverted selected items for user: {0}
cy: Dychwelwyd yr eitemau dewiswyd ar gyfer y defnyddiwr {0} yn llwyddiannus

source: Click here to select the check out location
cy: Cliciwch yma i ddewis y lleoliad gwirio allan

source: Run Report Again
cy: Rhedeg Adroddiad Eto

source: Unable to reassign the task due to system error:
cy: Methu ail-neilltuo'r tasg oherwydd gwall system:

source: Modify the permissions granted to a user for accessing your content.
cy: Newid y caniatadau sydd wedi wedi eu rhoi i ddefnyddiwr er mwyn gyrchu eich cynnwys.

source: Getting Started
cy: Dechrau

source: View the properties of a versioned content.
cy: Gweld y priodweddau o gynnwys fersiynnol.

source: Contributor
cy: Cyfrannwr

source: Rendering Engine
cy: Peiriant Llunio

source: Space names only
cy: Enwau lle yn unig

source: Join Date
cy: Dyddiad Ymuno

source: Undo Check Out
cy: Dadwneud Gwiriad Allan

source: Users
cy: Defnyddwyr

source: No broken links were found.
cy: Ni ganfuwyd unrhyw cysylltiadau toredig.

source: View the content properties.
cy: Gweld priodweddau'r cynnwys

source: Category "{0}"
cy: Categori "{0}"

source: Deploy Sandbox
cy: Darparu Blwch Tywod

source: Required Field
cy: Maes Angenrheidiol

source: No unallocated test servers are available.
cy: Does dim gweinyddion rhydd ar gael.

source: Add Role
cy: Ychwanegu Rôl

source: Web Form Details
cy: Manylion Ffurflen Gwe

source: Online Help
cy: Cymorth Ar-lein

source: Step Four - Configure Workflow
cy: Cam Pedwar - Ffurfweddu Llif Gwaith

source: Web Content Details
cy: Manylion Cynnwys Gwe

source: Broken links were checked at {0} using snapshot {1}.
cy: Gwiriwyd cysylltiadau toredig am {0} gyda ciplun {1}.

source: Step One - Select Layout
cy: Cam Un - Dewis Gosodiad

source: Unable to find Web Form {0} associated with {1}.
cy: Methu canfod y Ffurflen Gwe {0} sydd wedi'i gysylltu â {1}.

source: Save Changes
cy: Cadw Newidiadau

source: Allow Multilingual Aspect
cy: Caniatáu Agwedd Amlieithog

source: Failed to recover the item "{0}" due to error: {1}
cy: Methwyd adfer yr eitem "{0}" oherwydd gwall: {1}

source: Rendering Engine Template
cy: Templed Peiriant Llunio

source: Click to add to list
cy: Cliciwch i ychwanegu i'r rhestr

source: Submit Items
cy: Cyflwyno Eitemau

source: A copy of the file ''{0}'' will be made for you to work with.
cy: Bydd copi o'r ffeil yn cael ei wneud i chi weithio gyda.

source: Delete Forum Space
cy: Dileu Lle Fforwm

source: Regenerated all rendition for content authored using forms {0}.
cy: Wedi ail-gynhyrchu pob lluniad ar gyfer cynnwys a gynhyrchwyd gan defnyddio ffurflenni {0}.

source: Item does not have aspect ''{0}''
cy: Agwedd "{0}" nid gan yr eitem

source: Number of rules applied to this Space
cy: Y nifer o rheolau sydd wedi eu osod ar a Lle yma

source: Are you sure you want to remove "{0}" from the sandbox?
cy: A ydych chi'n siŵr eich bod eisiau dileu "{0}" o'r blwch tywod?

source: Unable to find form {0} in web project {1}.
cy: Methu canfod y ffurflen {0} yn y project gwe {1}.

source: Creating From
cy: Creu o

source: Create Web Project Wizard
cy: Dewin Creu Project Gwe

source: To create the topic click Create Topic.
cy: I greu'r pwnc cliciwch Creu Pwnc.

source: Cannot create a new edition because the following translations are checked out.
cy: Methu creu argraffiad newydd oherwydd bod y cyfieithiadau dilynol wedi'u gwirio allan.

source: Preview In Template
cy: Rhagolygu Gyda Templed

source: Enter information about the new forum then click Create Forum.
cy: Mewnbynnwch gwybodaeth am y fforwm newydd a chliciwch Creu Fforwm.

source: Topic Properties
cy: Priodweddau Pwnc

source: OK
cy: Iawn

source: Are you sure you want to undo the changes to all files in the sandbox?
cy: A ydych chi'n siŵr eich bod eisiau dadwneud pob newidiad i ffeiliau yn y blwch tywod?

source: Modify all properties when this wizard closes.
cy: Newid pob priodwedd pan fo'r dewin yma yn cau.

source: and its sub-categories
cy: a'i holl is-gategorïau

source: None
cy: Dim

source: Select the web project in which you want to regenerate renditions.
cy: Dewis y project gwe eich bod eisiau ail-gynhyrchu yn.

source: To remove this topic and its posts, click OK.
cy: I dileu'r pwnc yma a'i holl hysbysiadau, cliciwch Iawn.

source: This dialog allows you to change the expiration date for a modified item.
cy: Mae'r deialog yma yn gadael chi newid y dyddiad darfod ar eitem addasedig.

source: The item "{0}" has been permanently deleted.
cy: Wedi dileu yr eitem "{0}" am byth.

source: Submitted By
cy: Cyflwynwyd Gan

source: No
cy: Nage

source: Select a script...
cy: Dewis sgript...

source: On
cy: Ar

source: Link Validation Report for Submitted Items
cy: Adroddiad Dilysu Cysylltiadau ar gyfer Eitemau a Gyflwynwyd

source: Home Space Location
cy: Lleoliad Lle Cartref

source: If this option is selected the export will be performed in the background so the results may not appear immediately. You may also want to monitor the server console and log files for errors.
cy: Os ddewisir y dewisiad yma bydd yr allforyn yn cael ei berfformio yn y gefndir, ac efallai na fydd y ganlyniadau yn ymddangos ar unwaith. Efallai hoffech gwylio y consol gweinydd a'r ffeiliau cofnod am wallau.

source: Use the following workflow
cy: Defnyddiwch y llif gwaith dilynol

source: Search by Name
cy: Chwilio Enwau

source: {0} item to ''{1}'' if ''{2}'' action is taken.
cy: {0} eitem i "{1}" os mae gweithred "{2}" yn gael ei gymryd.

source: Delete Sandbox
cy: Dileu Blwch Tywod

source: Host
cy: Gwesteiwr

source: Modify Content Properties
cy: Newid Priodweddau Cynnwys

source: Specify Users/Groups
cy: Penodi Defnyddwyr/Grwpiau

source: Go
cy: Ewch

source: Manage the permissions you have granted to users who access your content.
cy: Rheoli'r caniatadau sydd wedi wedi eu rhoi i ddefnyddwyr sy'n cyrchu eich cynnwys.

source: To create the post click Post.
cy: I creu'r post cliciwch Postio.

source: Reassign Task
cy: Ail-Neilltuo Tasg

source: Column
cy: Colofn

source: This wizard helps you to give other users access to your content.
cy: Mae'r dewin yma yn eich cynorthwyo i roi cyrchiad i'ch cynnwys i ddefnyddwyr eraill.

source: Delete Rule
cy: Dileu Rheol

source: This wizard helps you modify a rule.
cy: Mae'r dewin yma yn eich cynorthwyo i newid rheol.

source: My Documents
cy: Fy Nogfennau

source: This document is part of the following advanced workflow(s)
cy: Mae'r dogfen yma yn rhan o'r llif(au) gwaith uwch dilynol

source: Step One - Invite Users
cy: Cam Un - Gwahodd Defnyddwyr

source: Advanced Space Wizard
cy: Dewin Lle Uwch

source: Name property matches ''{0}''
cy: Priodwedd enw yn cydweddu â "{0}"

source: Workflow Outline
cy: Amlinell Llif Gwaith

source: In the space selected
cy: Yn y lle dewiswyd

source: Choose whether you want to move or copy the content and also the location.
cy: Dewiswch a ddylid symud neu gopïo'r cynnwys a hefyd y lleoliad.

source: Body
cy: Corff

source: Edit User Wizard
cy: Dewin Golygu Defnyddiwr

source: With content
cy: Gyda cynnwys

source: Edit Folder Properties
cy: Golygu Priodweddau Ffolder

source: Note: You will lose any changes already made to this document.
cy: Nodyn: Byddwch yn colli unrhyw newidiadau wedi eu gwneud i'r dogfen yn barod.

source: To remove this forum and its topics, click OK.
cy: I gwaredu'r fforwm yma a'i pynciau, cliciwch OK.

source: Error getting results for search "{0}" - "{1}"
cy: Gwall yn nôl canlyniadau ar gyfer y chwiliad "{0}" - "{1}"

source: Please correct the errors below then click OK.
cy: Cywirwch y wallau isod a chliciwch Iawn, os gwelwch yn dda.

source: To create your space click Create Space.
cy: I greu eich lle cliciwch Creu Lle

source: Review Priority
cy: Blaenoriaeth Adolygiad

source: Step Seven - Email Users
cy: Cam Saith - Anfon E-bost

source: Configure
cy: Ffurfweddu

source: Edit Web Form Wizard
cy: Dewin Golygu Ffurflen Gwe

source: My Details
cy: Fy Manylion

source: Item is not in category ''{0}''
cy: Eitem dim yn y categori "{0}"

source: Check In Action
cy: Gweithred Gwirio i Fewn

source: This view allows you to browse forum spaces and forums.
cy: Mae'r golwg yma yn caniatáu i chi pori lleoedd fforwm a fforymau.

source: Click here to select the destination
cy: Cliciwch yma i ddewis y cyrchfan

source: Transform Image Action
cy: Gweithred Trawsffurfio Delwedd

source: List of tasks allocated to your pool
cy: Rhestr o'ch tasgau a neilltuwyd i'ch pwll

source: Create Web Content Wizard
cy: Dewin Creu Cynnwys Gwe

source: Category Browsing
cy: Pori Categori

source: Step Two - Edition Details
cy: Cam Dau - Manylion Argraffiad

source: Add Feature Action
cy: Gweithred Ychwanegu Nodwedd

source: Reply Message
cy: Neges Ateb

source: Modify
cy: Newid

source: Use this page to manage manage multilingual content.
cy: Defnyddiwch y dudalen yma i rheoli cynnwys amlieithog

source: Package Name
cy: Enw Pecyn

source: Completed
cy: Wedi Cwblhau

source: Location
cy: Lleoliad

source: Replies
cy: Atebion

source: Invalid website DNS name: only alpha-numeric and non-initial/final hyphen characters are allowed (max length < 64).
cy: Enw DNS safle gwe annilys: dim ond nodau alffaniwmerig a chysylltnodau di-gychwynnol/terfynol a ganiateir (hyd uchaf < 64).

source: Password must be between {0} and {1} characters in length.
cy: Rhaid i hyd y cyfrinair fod rhwng {0} a {1} llythrennau

source: Use this page to change your options and settings
cy: Defnyddiwch y dudalen yma i newid eich dewisiadau a gosodiadau

source: Reply to
cy: Ateb i

source: Editions
cy: Argraffiadau

source: Reply
cy: Ateb

source: Create a space in your home space
cy: Creu lle yn eich lle cartref

source: Click here to select a Category
cy: Cliciwch yma i ddewis categori

source: Condition
cy: Amod

source: Format
cy: Fformat

source: Submit {0,choice,0#__SHOULD NOT BE ZERO__|1#{1}|1<these {0,number} files} when wizard finishes.
cy: Cyflwyno{0,choice,0#__SHOULD NOT BE ZERO__|1# {1}|1<''r {0,number} ffeiliau yma} pan fo''r dewin yn gorffen.

source: To close this wizard and create your web project space click Finish. To review or change your selections click Back.
cy: I gau'r dewin yma a chreu eich lle project gwe cliciwch Gorffen. I adolygu neu i newid eich dewisiadau cliciwch Nôl.

source: not set
cy: dim wedi gosod

source: You may want to
cy: Efallai eich bod eisiau

source: Template Space
cy: Lle Templed

source: Use the Search to find deleted items by name or content and use the filters to reduce the list.
cy: Defnyddiwch y Chwiliad i canfod eitem drwy enw neu gynnwys a'r hidlau i leihau'r nifer o ganlyniadau.

source: To close the wizard and create the user sandboxes click Finish. To review or change your selections click Back.
cy: I gau'r dewin a chreu'r blychau tywod cliciwch Gorffen. I rhagolygu neu i newid eich dewisiadau cliciwch Nôl.

source: Generated XML content for form: {0}
cy: Cynnwys XML a gynhyrchwyd ar gyfer ffurflen: {0}

source: Manage Task
cy: Rheoli Tasg

source: Create Folder
cy: Creu Ffolder

source: Target Name
cy: Enw Targed

source: Simple Workflow Action
cy: Gweithred Llif Gwaith Syml

source: To
cy: I

source: When the download is complete, click Close.
cy: Pan mae'r lawrlwythiad yn gyflawn, cliciwch Iawn.

source: Selected
cy: Dewiswyd

source: To add the content to this space click Finish. To review or change your selections click Back.
cy: I ychwanegu cynnwys i'r lle yma cliciwch Gorffen. I adolygu neu i newid eich dewisiadau cliciwch Nôl.

source: Server
cy: Gweinydd

source: Layout
cy: Cynllun

source: My Alfresco
cy: Fy Alfresco

source: The results of recovering the selected items
cy: Y canlyniadau o adfer yr eitemau dewiswyd

source: Change Roles
cy: Newid Rolau

source: Add Category
cy: Ychwanegu Categori

source: Add a translation to the document.
cy: Ychwanegu cyfieithiad i'r dogfen

source: View details about the forum space.
cy: Gweld manylion am y lle fforwm.

source: This document has the following categories applied...
cy: Mae'r categorïau isod wedi eu cymhwyso i'r ddogfen.

source: Use this view to browse the staging area and user sandboxes for a web project.
cy: Defnyddiwch yr olwg yma i bori'r ardal llwyfo a'r blychau tywod defnyddwyr ar gyfer project gwe.

source: Are you sure you want to remove "{0}" and its {1} associated {1,choice,0#renditions|1#rendition|1<renditions} from the sandbox?
cy: A ydych chi'n siŵr eich bod eisiau dileu "{0}" a'i {1} {1,choice,0#lluniad|1#lluniad|1<lluniadau} cysylltiedig o'r blwch tywod?

source: Single Column
cy: Un Colofn

source: Unable to find Web Form {0} associated with {1} in Web Project {2}.
cy: Methu canfod y Ffurflen Gwe {0} sydd wedi'i gysylltu â {1} mewn Project Gwe {2}.

source: Current Space
cy: Lle Presennol

source: DNS name
cy: Enw DNS

source: Include child spaces
cy: Cynnwys lleoedd plentyn

source: Deployment Successful
cy: Darpariaeth Llwyddiannus

source: Snapshot
cy: Ciplun

source: User Name
cy: Enw Defnyddiwr

source: Create Sub-Group
cy: Creu Is-Grŵp

source: Output path pattern
cy: Patrwm llwybr allbwn

source: Please correct the errors below then click Create Forum.
cy: Cywirwch y wallau isod a chliciwch Creu Fforwm, os gwelwch yn dda.

source: Watch a demonstration of how Alfresco can be used to create a marketing launch.
cy: Gwyliwch arddangosiad o sut gallwch chi creu lansiad marchnata gyda Alfresco.

source: This wizard helps you edit a form.
cy: Mae'r dewin yma yn eich cynorthwyo i olygu ffurflen.

source: Manage Invited Users
cy: Rheoli Defnyddwyr Gwahoddedig

source: No items to display. Click the ''{0}'' action to create a space.
cy: Dim eitemau i ddangos. Cliciwch y gweithred "{0}" i greu lle.

source: Items
cy: Eitemau

source: Subject
cy: Pwnc

source: Create Rule Wizard
cy: Dewin Creu Rheol

source: The User will no longer be able to access this content. Are you sure you want to remove user "{0}"?
cy: Ni bydd y defnyddiwr yn gallu cyrchu'r cynnwys yma bellach. A ydych chi'n siŵr eich bod eisiau tynnu'r defnyddiwr "{0}"?

source: Title
cy: Teitl

source: Navigate to your home space. In the space info area, from the menu under Create, click Create Space and enter information about the space.
cy: Llywio i'ch lle cartref. Yn yr ardal gwybodaeth lle, cliciwch Creu Lle o dan Creu a mewnbynnwch gwybodaeth am y lle.

source: Rendered by {0} into {1}
cy: Lluniwyd gan {0} i {1}

source: This space is not part of a simple workflow.
cy: Nid yw'r lle yn rhan o unrhyw llifiau gwaith syml.

source: To add the user to this space click Finish. To review or change your selections click Back.
cy: I ychwanegu'r defnyddiwr i'r lle cliciwch Gorffen. I adolygu neu i newid eich dewisiadau cliciwch Nôl.

source: Step One - Edition Details
cy: Cam Un - Manylion Argraffiad

source: This workflow does not have any history
cy: Nid oes gan y llif gwaith yma unrhyw hanes

source: Results for ''{0}''.
cy: Canlyniadau "{0}"

source: Remove aspect ''{0}''
cy: Tynnu agwedd "{0}"

source: {0} discussion
cy: Trafodaeth {0}

source: Move to ''{0}''
cy: Symud i "{0}"

source: Inherit Parent Space Permissions
cy: Etifeddu Caniatadau Lle Rhiant

source: New User Wizard
cy: Dewin Defnyddiwr Newydd

source: Imports to ''{0}''
cy: Mewnforir i "{0}"

source: Search Results
cy: Canlyniadau Chwiliad

source: Undo Selected
cy: Dadwneud Dewiswyd

source: Select a template...
cy: Dewis templed...

source: Steps
cy: Camau

source: Use this dialog to import an archive of content into the web project.
cy: Defnyddiwch y deialog yma i fewnforio archif cynnwys i'r project gwe.

source: Checked out by
cy: Wedi gwirio allan gan

source: Selected Templates
cy: Templedi Dewisedig

source: Do you want to provide a reject step?
cy: A ydych eisiau darparu cam gwrthod?

source: Preview File
cy: Rhagolygu Ffeil

source: This wizard helps you modify a user in the repository.
cy: Mae'r dewin yma yn eich cynorthwyo i newid defnyddiwr yn y repositori

source: Remove or recover previously deleted items
cy: Tynnu neu adfer eitemau wedi'u dileu ynghynt

source: Last Page
cy: Tudalen Olaf

source: Create content in your home space
cy: Creu cynnwys yn eich lle cartref

source: Selected categories
cy: Categorïau dewiswyd

source: Deep Copy
cy: Copi Dwfn

source: Content Awaiting Launch
cy: Cynnwys yn Disgwyl Lansiad

source: To remove all deployment reports in the web project, click Yes.
cy: I waredu pob adroddiad darpariaeth yn y project gwe, cliciwch Ie.

source: Click upload
cy: Cliciwch llwytho i fyny

source: Please correct the errors below then click Create Group.
cy: Cywirwch y wallau isod a chliciwch Creu Grŵp, os gwelwch yn dda.

source: User Management
cy: Rheolaeth Defnyddwyr

source: Select the user to assign the task to, then press OK.
cy: Dewiswch y defnyddiwr i neilltuo'r tasg i, a chliciwch Iawn.

source: When you have completed your changes you need to check in the file to allow others to view the changes.
cy: Pan ydych wedi cwblhau eich newidiadau rhaid i chi gwirio i fewn y ffeil er mwyn i ddefnyddwyr eraill cael gweld y newidiadau.

source: Additional options
cy: Dewisiadau ychwanegol

source: Items Per Page
cy: Eitemau y tudalen

source: Unable to update Content Node due to system error:
cy: Methu diweddaru Nôd Cynnwys oherwydd gwall system:

source: Form {0} is not configured for web project {1}.
cy: Nid yw'r ffurflen {0} wedi'i ffurfweddu ar gyfer y project gwe {1}.

source: Last command:
cy: Gorchymyn olaf:

source: Create New Category
cy: Creu Categori Newydd

source: Specify details for new form.
cy: Mewnbynnwch manylion y ffurflen newydd.

source: Step One - Person Properties
cy: Cam Un - Manylion Person

source: This dialog shows the results of a link validation check and allows you to fix broken links.
cy: Mae'r deialog yma yn dangos y canlyniadau gwiriad dilysu cysylltiadau ac yn galluogi chi i trwsio cysylltiadau toredig.

source: Select the column to configure
cy: Dewis y colofn i ffurfweddu

source: Workflow not configured
cy: Llif gwaith dim wedi ei ffurfweddu

source: Go up
cy: I fyny

source: Minor Change
cy: Newid Minor

source: Edit Text File Inline
cy: Golygu Ffeil Testun Mewn-lein

source: Please correct the import errors below then click OK.
cy: Cywirwch y wallau mewnforio isod a chliciwch Iawn, os gwelwch yn dda.

source: Save As Template
cy: Cadw fel Templed

source: To close this wizard and apply your changes click Finish. To review or change your selections click Back.
cy: I gau'r dewin yma a gweithredu eich newidiadau cliciwch Gorffen. I rhagolygu neu i newid eich dewisiadau cliciwch Nôl.

source: Search for "{0}" results shown below
cy: Dangosir y canlyniadau am y chwiliad "{0}" isod

source: Failed to recover the item "{0}" as there is now an item in the parent folder with the same name, please select a new folder destination.
cy: Methwyd adfer yr eitem "{0}" gan fod yna eitem gyda'r un enw yn y ffolder rhiant. Dewiswch cyrchfan arall, os gwelwch y dda.

source: Select the rendering engine template to use
cy: Dewiswch y templed peiriant llunio i ddefnyddio

source: Save
cy: Cadw

source: Condition Settings
cy: Gosodiadau Amod

source: There are no deployment attempts to display in this date range.
cy: Nid oes unrhyw cais darpariaeth i ddangos yn yr amrediad dyddiad yma.

source: Step One - Web Content Details
cy: Cam Un - Manylion Cynnwys Gwe

source: Create Rule
cy: Creu Rheol

source: Workflow Options
cy: Dewisiadau Llif Gwaith

source: File Name
cy: Enw Ffeil

source: Unable to delete Rule due to system error:
cy: Methu dileu'r Rheol oherwydd gwall system:

source: Select a type...
cy: Dewis math...

source: Failed to generate url for search engine '{0}'.\n\nThis is probably caused by missing required parameters, check the template url for the search engine.
cy: Methwyd cynhyrchu URL i beiriant chwilio '{0}'.\n\nMwy na thebyg achoswyd hwn gan paramedrau angenrheidiol sydd ar goll, gwiriwch templed URL y peiriant chwilio.

source: Other Properties
cy: Priodweddau Eraill

source: RSS Feed Link
cy: Cyswllt Porthiant RSS

source: Users and Roles
cy: Defnyddwyr a Rolau

source: Are you sure you want to remove "{0}" and its contents from the sandbox?
cy: A ydych chi'n siŵr eich bod eisiau dileu "{0}" a'i gynnwys o'r blwch tywod?

source: Search Website
cy: Chwilio Safle Gwe

source: Reapply Rules in Space and Children
cy: Ailgymhwyso Rheolau yn y Lle Yma a'i Blant

source: Properties from a versioned content
cy: Priodweddau o gynnwys fersiynnol

source: Unable to login - unknown username/password.
cy: Methu mewngofnodi - enw defnyddiwr neu gyfrinair anhysbys.

source: Edit details of the Alfresco Server Receiver
cy: Golygu manylion y Derbyniwr Gweinydd Alfresco

source: You have been invited to ''{0}'' by {1}.
cy: Rydych wedi eich gwahodd i "{0}" gan {1}.

source: Selected Rendering Engines
cy: Peiriannau Llunio Dewiswyd

source: The latest snapshot version is {0}.
cy: Y fersiwn ciplun diweddaraf yw {0}.

source: Only the folders within this space.
cy: Ffolderau yn y lle yma yn unig.

source: Edit file
cy: Golygu ffeil

source: Please correct the errors below then click Finish.
cy: Cywirwch y wallau isod a chliciwch Gorffen os gwelwch yn dda.
